Repository: Gaoyifei1011/GetStoreApp
Catalog: GetStoreApp/Strings/*/Console.resw
Source language: en_us
Languages: ar, zh_hans

source: App description:
ar: وصف التطبيق:
zh_hans: 应用描述：

source: App information：
ar: معلومات التطبيق:
zh_hans: 应用信息：

# ApplicationExit
source: The program is exiting...
ar: جارٍ الخروج من البرنامج...
zh_hans: 程序正在退出...

source: App name:
ar: اسم التطبيق:
zh_hans: 应用名称：

# AskContinue
source: Do you want to try to get it again? (Make sure to input "Y", exit entering other characters)
ar: هل ترغب في المحاولة مرة أخرى للحصول عليه؟ (تأكد من إدخال "Y"، والخروج بإدخال أحرف أخرى)
zh_hans: 您是否想要尝试重新获取？（确定输入“Y”，退出输入其他字符）

source: CategoryID:
ar: معرف الفئة:

# ChannelInformation
source: There are four channels for download links: 1. Fast, 2. Slow, 3. Release Preview, and 4. Official Version
ar: يوجد أربعة قنوات لروابط التحميل: 1. سريع، 2. بطيء، 3. معاينة الإصدار، و4. النسخة الرسمية
zh_hans: 下载链接共有四种通道：1.快速、2.慢速、3.发布预览、4.正式版

# DownloadCompleted
source: All files have been downloaded, do you want to download other files? (Make sure to input "Y", exit entering other characters)
ar: تم تحميل الملف {0} بنجاح
zh_hans: 所有文件都已经下载完成，是否要下载其他文件？（确定输入“Y”，退出输入其他字符）

# DownloadFile
source: Please input the serial number of the file you want to download, and if there are multiple files downloaded, separate them with English commas(",")
ar: يرجى إدخال الرقم التسلسلي للملف الذي ترغب في تحميله، وإذا كان هناك عدة ملفات، افصل بينها بفواصل إنجليزية (",")
zh_hans: 请输入您要下载文件的序号，如果有多个文件下载请使用英文逗号隔开（“,”）

# DownloadingInformation
source: Downloading {0} file, {1} files in total
ar: جارٍ تحميل {0} ملف، {1} ملفات إجمالاً
zh_hans: 正在下载第{0}个文件，共{1}个文件

# ExitPrompt
source: Are you sure want to quit?
ar: هل أنت متأكد أنك ترغب في الخروج؟
zh_hans: 您确定要退出吗？

source: File name
ar: اسم الملف
zh_hans: 文件名称

source: File size
ar: حجم الملف
zh_hans: 文件大小

source: Get completed
ar: تم الحصول على البيانات بنجاح
zh_hans: 获取完成

# GettingNow
source: Queries are being made from the servers in the Microsoft Store, please be patient...
ar: يتم إجراء الاستعلامات من الخوادم في متجر مايكروسوفت، يرجى الانتظار...
zh_hans: 正在从微软商店的服务器中进行查询，请耐心等待......

# HeaderDescription1
source: Get the Store app (console) version: {0}.{1}.{2}.{3}
ar: الحصول على إصدار تطبيق المتجر (وحدة التحكم): {0}.{1}.{2}.{3}
zh_hans: 获取商店应用（控制台程序）版本：{0}.{1}.{2}.{3}

# HeaderDescription2
source: Get the Store app (console program) to quickly query and download the installation package for Microsoft Store apps.
ar: احصل على تطبيق المتجر (برنامج وحدة التحكم) للاستعلام بسرعة وتنزيل حزمة التثبيت لتطبيقات متجر مايكروسوفت.
zh_hans: 获取商店应用（控制台程序）可以快速查询并下载微软商店应用的安装包。

# HeaderDescription3
source: For more information, navigate to the "About" page of the application and learn about it in the "Usage Instructions" module.
ar: لمزيد من المعلومات، انتقل إلى صفحة "حول" في التطبيق وتعرف عليها في وحدة "تعليمات الاستخدام".
zh_hans: 具体的操作方法请导航到应用的“关于”页面，“使用说明”模块中进行了解。

# InputLink
source: Please enter the corresponding link:
ar: يرجى إدخال الرابط المقابل:
zh_hans: 请输入对应的链接：

source: None
ar: لا شيء
zh_hans: 无

# OpenFolder
source: Opening the downloaded folder, please wait...
ar: جارٍ فتح المجلد الذي تم تحميله، يرجى الانتظار...
zh_hans: 正在打开已下载完成的目录，请稍候...

# ParameterError
source: The parameters you inputed are incorrect, please check the parameters you inputed
ar: المعلمات التي أدخلتها غير صحيحة، يرجى التحقق من المعلمات التي أدخلتها
zh_hans: 您输入的参数有误，请检查您输入的参数

# ProductIDSample
source: ProductID sample: 9WZDNCRFJBMP
ar: عينة معرف المنتج: 9WZDNCRFJBMP
zh_hans: 产品 ID 例子：9WZDNCRFJBMP

# RequestError
source: An error occurred in fetching data from the servers of the Microsoft Store, please check your network before trying to get it again
ar: حدث خطأ في استرداد البيانات من خوادم متجر مايكروسوفت، يرجى التحقق من الشبكة قبل المحاولة مرة أخرى
zh_hans: 从微软商店的服务器中获取数据发生了错误，请检查您的网络后再尝试重新获取

# RequestFailed
source: The server returns empty data. You may not have entered the correct link, or the service does not support the build of this product
ar: عاد الخادم ببيانات فارغة. قد لا تكون قد أدخلت الرابط الصحيح، أو أن الخدمة لا تدعم إصدار هذا المنتج
zh_hans: 服务器返回空数据。您可能没有输入正确的链接，或者服务不支持此产品的生成

# RequestSuccessfully
source: These links were successfully received from the servers of the Microsoft Store
ar: تم استلام هذه الروابط بنجاح من خوادم متجر مايكروسوفت
zh_hans: 已成功从微软商店的服务器中接收到这些链接

# SelectChannel
source: Please enter the channel you want to select (the default is production):
ar: يرجى إدخال القناة التي ترغب في تحديدها (الإنتاج هو الافتراضي):
zh_hans: 请输入您要选择的通道（默认选择正式版）：

# SelectType
source: Please enter the type you want to select (default selection URL (link)):
ar: يرجى إدخال النوع الذي ترغب في تحديده (الرابط الافتراضي هو URL):
zh_hans: 请输入您要选择的类型（默认选择URL（链接））：

source: Serial number
ar: الرقم التسلسلي
zh_hans: 序号

# SerialNumberError
source: You entered the wrong serial number, do you want to re-enter it? (Make sure to input "Y", exit entering other characters)
ar: أدخلت الرقم التسلسلي بشكل خاطئ، هل ترغب في إعادة إدخاله؟ (تأكد من إدخال "Y"، والخروج بإدخال أحرف أخرى)
zh_hans: 您输入的序号格式有误，是否要重新输入？（确定输入“Y”，退出输入其他字符）

# SerialNumberOutRange
source: You inputed the serial number that is out of range, entered it incorrectly, do you want to re-input it? (Make sure to input "Y", exit entering other characters)
ar: أدخلت الرقم التسلسلي الذي يتجاوز النطاق، أو أدخلته بشكل خاطئ، هل ترغب في إعادة إدخاله؟ (تأكد من إدخال "Y"، والخروج بإدخال أحرف أخرى)
zh_hans: 您输入的序号已经超出了范围，输入有误，是否要重新输入？（确定输入“Y”，退出输入其他字符）

# TypeInformation
source: There are two types of acquisition apps:1. URL (link), 2.ProductID
ar: يوجد نوعان من تطبيقات الاستحواذ: 1. URL (رابط)، 2. ProductID
zh_hans: 获取应用有两种类型：1.URL（链接）、2.产品 ID

# URLSample
source: URL(link) sample: https://www.microsoft.com/store/productId/9WZDNCRFJBMP
ar: عينة URL (رابط): https://www.microsoft.com/store/productId/9WZDNCRFJBMP
zh_hans: URL（链接）例子：https://www.microsoft.com/store/productId/9WZDNCRFJBMP

# Title
source: GetStoreApp
zh_hans: 获取商店应用
